[
    null,
    {
        "phrase": "Интерне́т  — коммуникационная сеть и всемирная система объединённых компьютерных сетей для хранения и передачи информации.\n",
        "task": "Интерне́т  — коммуникационная сеть и всемирная система объединённых компьютерных сетей для <<<хранения и передачи информации>>>.\n",
        "word": "для"
    },
    null,
    null,
    null,
    null,
    {
        "phrase": "Со́товый телефо́н, или моби́льный телефо́н, — телефон, предназначенный для работы в сетях сотовой связи; использует приёмопередатчик радиодиапазона и традиционную телефонную коммутацию для осуществления телефонной связи на территории зоны покрытия сотовой сети.\n",
        "task": "Со́товый телефо́н, или моби́льный телефо́н, — телефон, предназначенный для <<<работы в сетях сотовой связи; использует приёмопередатчик радиодиапазона и традиционную телефонную коммутацию для осуществления телефонной связи на территории зоны покрытия сотовой сети>>>.\n",
        "word": "для"
    },
    null,
    null,
    null,
    {
        "phrase": "Компью́терная програ́мма — 1) комбинация компьютерных инструкций и данных, позволяющая аппаратному обеспечению вычислительной системы выполнять вычисления или функции управления ; 2) синтаксическая единица, которая соответствует правилам определённого языка программирования, состоящая из определений и операторов или инструкций, необходимых для определённой функции, задачи или решения проблемы .\n",
        "task": "Компью́терная програ́мма — 1) комбинация компьютерных инструкций и данных, позволяющая аппаратному обеспечению вычислительной системы выполнять вычисления или функции управления ; 2) синтаксическая единица, которая соответствует правилам определённого языка программирования, состоящая из определений и операторов или инструкций, необходимых для <<<определённой функции, задачи или решения проблемы>>> .\n",
        "word": "для"
    },
    null,
    null,
    null,
    {
        "phrase": "Система мгновенного обмена сообщениями, система обмена мгновенными сообщениями, ме́ссенджер  — службы мгновенных сообщений , программы онлайн-консультанты , и программы-клиенты  для обмена сообщениями в реальном времени через Интернет. Могут передаваться текстовые сообщения, звуковые сигналы, изображения, видео, а также производиться такие действия, как совместное рисование или игры. Многие из таких программ-клиентов могут применяться для организации групповых текстовых чатов или видеоконференций.\n",
        "task": "Система мгновенного обмена сообщениями, система обмена мгновенными сообщениями, ме́ссенджер  — службы мгновенных сообщений , программы онлайн-консультанты , и программы-клиенты  для <<<обмена сообщениями в реальном времени через Интернет>>>. Могут передаваться текстовые сообщения, звуковые сигналы, изображения, видео, а также производиться такие действия, как совместное рисование или игры. Многие из таких программ-клиентов могут применяться для организации групповых текстовых чатов или видеоконференций.\n",
        "word": "для"
    },
    null,
    null,
    {
        "phrase": "Видеока́рта  — устройство, преобразующее графический образ, хранящийся как содержимое памяти компьютера , в форму, пригодную для дальнейшего вывода на экран монитора. Обычно видеокарта выполнена в виде печатной платы  и вставляется в слот расширения материнской платы — универсальный, либо специализированный .\n",
        "task": "Видеока́рта  — устройство, преобразующее графический образ, хранящийся как содержимое памяти компьютера , в форму, пригодную для <<<дальнейшего вывода на экран монитора>>>. Обычно видеокарта выполнена в виде печатной платы  и вставляется в слот расширения материнской платы — универсальный, либо специализированный .\n",
        "word": "для"
    },
    {
        "phrase": "Компью́терная мышь — координатное устройство для управления курсором и отдачи различных команд компьютеру. Управление курсором осуществляется путём перемещения мыши по поверхности стола или специального коврика. Кнопки и колёсико мыши вызывают определённые действия, например: активация указанного объекта, вызов контекстного меню, вертикальная и горизонтальная  прокрутка веб-страниц, окон операционной системы и электронных документов.\n",
        "task": "Компью́терная мышь — координатное устройство для <<<управления курсором и отдачи различных команд компьютеру>>>. Управление курсором осуществляется путём перемещения мыши по поверхности стола или специального коврика. Кнопки и колёсико мыши вызывают определённые действия, например: активация указанного объекта, вызов контекстного меню, вертикальная и горизонтальная  прокрутка веб-страниц, окон операционной системы и электронных документов.\n",
        "word": "для"
    },
    null,
    null,
    null,
    null,
    {
        "phrase": "Устро́йства вво́да — периферийное оборудование, предназначенное для ввода  данных или сигналов в компьютер или в другое электронное устройство во время его работы.\n",
        "task": "Устро́йства вво́да — периферийное оборудование, предназначенное для <<<ввода  данных или сигналов в компьютер или в другое электронное устройство во время его работы>>>.\n",
        "word": "для"
    },
    {
        "phrase": "Се́рвер  — выделенный или специализированный компьютер для выполнения сервисного программного обеспечения . \n",
        "task": "Се́рвер  — выделенный или специализированный компьютер для <<<выполнения сервисного программного обеспечения>>> . \n",
        "word": "для"
    },
    null,
    null,
    null,
    {
        "phrase": "Транзи́стор , полупроводнико́вый трио́д — электронный компонент из полупроводникового материала, способный небольшим входным сигналом управлять значительным током в выходной цепи, что позволяет использовать его для усиления, генерирования, коммутации и преобразования электрических сигналов. В настоящее время транзистор является основой схемотехники подавляющего большинства электронных устройств и интегральных микросхем.\n",
        "task": "Транзи́стор , полупроводнико́вый трио́д — электронный компонент из полупроводникового материала, способный небольшим входным сигналом управлять значительным током в выходной цепи, что позволяет использовать его для <<<усиления, генерирования, коммутации и преобразования электрических сигналов>>>. В настоящее время транзистор является основой схемотехники подавляющего большинства электронных устройств и интегральных микросхем.\n",
        "word": "для"
    },
    {
        "phrase": "Универса́льная десяти́чная классифика́ция  — система классификации информации, широко используется во всём мире для систематизации произведений науки, литературы и искусства, периодической печати, различных видов документов и организации картотек. На 2007 год содержит 126 441 код УДК.\n",
        "task": "Универса́льная десяти́чная классифика́ция  — система классификации информации, широко используется <<<во всём мире для систематизации произведений науки, литературы и искусства, периодической печати, различных видов документов и организации картотек.>>> На 2007 год содержит 126 441 код УДК.\n",
        "word": "используется"
    },
    {
        "phrase": "Плаги́н  — независимо компилируемый программный модуль, динамически подключаемый к основной программе и предназначенный для расширения и/или использования её возможностей. Плагины обычно выполняются в виде библиотек общего пользования.\n",
        "task": "Плаги́н  — независимо компилируемый программный модуль, динамически подключаемый к основной программе и предназначенный для <<<расширения и/или использования её возможностей>>>. Плагины обычно выполняются в виде библиотек общего пользования.\n",
        "word": "для"
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    {
        "phrase": " Интегри́рованная среда́ разрабо́тки, ИСP , также единая среда разработки, ЕСР — комплекс программных средств, используемый программистами для разработки программного обеспечения .\n",
        "task": " Интегри́рованная среда́ разрабо́тки, ИСP , также единая среда разработки, ЕСР — комплекс программных средств, используемый программистами для <<<разработки программного обеспечения>>> .\n",
        "word": "для"
    },
    null,
    null,
    null,
    {
        "phrase": "Дистрибутив GNU/Linux — общее определение операционных систем, использующих ядро Linux, готовых для конечной установки на пользовательское оборудование. Поставляемая в рамках дистрибутива операционная система состоит из ядра Linux и, как правило, включает в себя набор библиотек и утилит, выпускаемых в рамках проекта GNU, а также графическую подсистему на основе X Window System или Wayland и набор приложений, таких как редакторы документов и таблиц, проигрыватели мультимедиа, системы для работы с базами данных и т. д. Небольшие дистрибутивы могут не включать в состав подсистему X, и, в целях экономии, предлагать альтернативы GNU-утилитам, такие как musl, Busybox, uClibc или dietlibs.\n",
        "task": "Дистрибутив GNU/Linux — общее определение операционных систем, использующих ядро Linux, готовых для <<<конечной установки на пользовательское оборудование>>>. Поставляемая в рамках дистрибутива операционная система состоит из ядра Linux и, как правило, включает в себя набор библиотек и утилит, выпускаемых в рамках проекта GNU, а также графическую подсистему на основе X Window System или Wayland и набор приложений, таких как редакторы документов и таблиц, проигрыватели мультимедиа, системы для работы с базами данных и т. д. Небольшие дистрибутивы могут не включать в состав подсистему X, и, в целях экономии, предлагать альтернативы GNU-утилитам, такие как musl, Busybox, uClibc или dietlibs.\n",
        "word": "для"
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    {
        "phrase": "Системные требования - это спецификации и характеристики, которые должны быть у компьютерной системы , чтобы оно могло корректно функционировать и выполнять свои задачи. Эти требования определяют минимальные и рекомендуемые характеристики аппаратного и программного обеспечения, которые необходимы для оптимальной работы системы.\n",
        "task": "Системные требования - это спецификации и характеристики, которые должны быть у компьютерной системы , чтобы <<<>>> оно могло корректно функционировать и выполнять свои задачи. Эти требования определяют минимальные и рекомендуемые характеристики аппаратного и программного обеспечения, которые необходимы для оптимальной работы системы.\n",
        "word": "чтобы"
    },
    {
        "phrase": "Язы́к программи́рования — формальный язык, предназначенный для записи компьютерных программ. Язык программирования определяет набор лексических, синтаксических и семантических правил, определяющих внешний вид программы и действия, которые выполнит исполнитель  под её управлением.\n",
        "task": "Язы́к программи́рования — формальный язык, предназначенный для <<<записи компьютерных программ>>>. Язык программирования определяет набор лексических, синтаксических и семантических правил, определяющих внешний вид программы и действия, которые выполнит исполнитель  под её управлением.\n",
        "word": "для"
    },
    null,
    null,
    {
        "phrase": "Графи́ческий интерфе́йс по́льзователя , графи́ческий по́льзовательский интерфе́йс   — система средств для взаимодействия пользователя с электронными устройствами, основанная на представлении всех доступных пользователю системных объектов и функций в виде графических компонентов экрана .\n",
        "task": "Графи́ческий интерфе́йс по́льзователя , графи́ческий по́льзовательский интерфе́йс   — система средств для <<<взаимодействия пользователя с электронными устройствами>>>, основанная на представлении всех доступных пользователю системных объектов и функций в виде графических компонентов экрана .\n",
        "word": "для"
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    {
        "phrase": "Информацио́нные техноло́гии  — процессы, использующие совокупность средств и методов сбора, обработки, накопления и передачи данных  для получения информации нового качества о состоянии объекта, процесса, явления, информационного продукта, а также распространения информации и способы осуществления таких процессов и методов .  \n",
        "task": "Информацио́нные техноло́гии  — процессы, использующие совокупность средств и методов сбора, обработки, накопления и передачи данных  для <<<получения информации нового качества о состоянии объекта, процесса, явления, информационного продукта, а также распространения информации>>> и способы осуществления таких процессов и методов .  \n",
        "word": "для"
    },
    {
        "phrase": "Литий-ионный аккумулятор  — тип электрического аккумулятора, который широко распространён в современной бытовой электронной технике и находит своё применение в качестве источника энергии в электромобилях и накопителях энергии в энергетических системах. Это самый популярный тип аккумуляторов в таких устройствах как сотовые телефоны, ноутбуки, цифровые фотоаппараты, видеокамеры и электромобили. В 2019 году Уиттингем, Гуденаф и Ёсино получили Нобелевскую премию по химии с формулировкой «За развитие литий-ионных аккумуляторов».\n",
        "task": "Литий-ионный аккумулятор  — тип электрического аккумулятора, который широко распространён в современной бытовой электронной технике и находит своё применение в качестве <<<>>> источника энергии в электромобилях и накопителях энергии в энергетических системах. Это самый популярный тип аккумуляторов в таких устройствах как сотовые телефоны, ноутбуки, цифровые фотоаппараты, видеокамеры и электромобили. В 2019 году Уиттингем, Гуденаф и Ёсино получили Нобелевскую премию по химии с формулировкой «За развитие литий-ионных аккумуляторов».\n",
        "word": "в качестве"
    },
    null,
    {
        "phrase": "Библиоте́ка  в программировании — сборник подпрограмм или объектов, используемых для разработки программного обеспечения . С точки зрения операционной системы  и прикладного ПО, библиотеки разделяются на динамические и статические.\n",
        "task": "Библиоте́ка  в программировании — сборник подпрограмм или объектов, используемых для <<<разработки программного обеспечения>>> . С точки зрения операционной системы  и прикладного ПО, библиотеки разделяются на динамические и статические.\n",
        "word": "для"
    },
    null,
    {
        "phrase": "Электро́нная вычисли́тельная маши́на  — комплекс технических, аппаратных и программных средств, предназначенных для автоматической обработки информации, вычислений, автоматического управления. При этом основные функциональные элементы  выполнены на электронных элементах. Термин машина означает устройство, выполняющее механические движения. Современные компьютеры не являются машинами, название сохранилось за ними от простых счётных машин.\n",
        "task": "Электро́нная вычисли́тельная маши́на  — комплекс технических, аппаратных и программных средств, предназначенных для <<<автоматической обработки информации, вычислений, автоматического управления>>>. При этом основные функциональные элементы  выполнены на электронных элементах. Термин машина означает устройство, выполняющее механические движения. Современные компьютеры не являются машинами, название сохранилось за ними от простых счётных машин.\n",
        "word": "для"
    },
    {
        "phrase": "Утили́та  — вспомогательная компьютерная программа в составе общего программного обеспечения для выполнения специализированных типовых задач, связанных с работой оборудования и операционной системы .\n",
        "task": "Утили́та  — вспомогательная компьютерная программа в составе общего программного обеспечения для <<<выполнения специализированных типовых задач, связанных с работой оборудования и операционной системы>>> .\n",
        "word": "для"
    }
]