{
  "id": "0068c197-044d-4243-9d33-c136093d2f0c.json",
  "task": "По размеру аппаратной части могут быть выделены различные классы ЭВМ.\n\u003c\u003c\u003cСупер ЭВМ .\nБольшие ЭВМ .\nМини-ЭВМ — малая ЭВМ, имеет небольшие размеры и стоимость. Появившись в конце 1960-х годов, мини-ЭВМ имели широкие возможности в решении задач различных классов.\nМикроЭВМ — ЭВМ малых размеров, созданная на базе микропроцессора. Ранее различали микроЭВМ следующих видов: встроенные и персональные, настольные и портативные, профессиональные и бытовые. Термин ПЭВМ  вытеснен синонимом «персональный компьютер» . В настоящее время персональные компьютеры не относятся к микрокомпьютерам.\u003e\u003e\u003e",
  "correct": [
    [
      "Супер ЭВМ .",
      "Большие ЭВМ .",
      "Мини-ЭВМ — малая ЭВМ, имеет небольшие размеры и стоимость. Появившись в конце 1960-х годов, мини-ЭВМ имели широкие возможности в решении задач различных классов.",
      "МикроЭВМ — ЭВМ малых размеров, созданная на базе микропроцессора. Ранее различали микроЭВМ следующих видов: встроенные и персональные, настольные и портативные, профессиональные и бытовые. Термин ПЭВМ  вытеснен синонимом «персональный компьютер» . В настоящее время персональные компьютеры не относятся к микрокомпьютерам."
    ],
    [
      "СуперБольшие",
      "Большие",
      "Мини",
      "Микро"
    ],
    [
      "Суперкомпьютеры – самые мощные и производительные ЭВМ, предназначенные для решения сложных задач, требующих больших вычислительных ресурсов.",
      "",
      "Мэйнфреймы – большие ЭВМ, способные обрабатывать огромные объемы данных и обслуживать множество пользователей одновременно. Часто используются в крупных организациях и научных центрах.",
      "",
      "Мини-компьютеры – компактные и доступные ЭВМ, появившиеся в конце 1960-х годов. Обладали широкими возможностями для решения разнообразных задач.",
      "",
      "Микрокомпьютеры – небольшие ЭВМ, созданные на основе микропроцессоров. Раньше подразделялись на встроенные, персональные, настольные, портативные, профессиональные и бытовые.",
      "",
      "Персональные компьютеры (ПК) – изначально относились к микрокомпьютерам, но со временем стали отдельной категорией, вытеснив термин \"ПЭВМ\"."
    ]
  ],
  "wrong": [
    "Гигантские",
    "Крохотные",
    "ыапрфвадолыв",
    "советские",
    "intel",
    "amd",
    "встроенные",
    "персональные",
    "настольные",
    "напольные",
    "ноутбук",
    "телефон",
    "смартфон",
    "мегафон",
    "квадрокоптер",
    "фуфелшмертц пакостин корпорейтед"
  ],
  "meta": {
    "type": "ul",
    "link": "https://ru.wikipedia.org/wiki/Электронная_вычислительная_машина"
  }
}