{
  "id": "021e8a96-0b37-44ce-87b1-102110eac925.json",
  "task": "Теория вычислимости, также известная как теория рекурсивных функций, —\u003c\u003c\u003c это раздел современной математики, лежащий на стыке математической логики, теории алгоритмов и информатики, возникшей в результате изучения понятий вычислимости и невычислимости. Изначально теория была посвящена вычислимым и невычислимым функциям и сравнению различных моделей вычислений. В наши дни поле исследования теории вычислимости расширилось — появляются новые определения понятия вычислимости и идёт слияние с математической логикой, где вместо вычислимости и невычислимости идёт речь о доказуемости и недоказуемости  утверждений в рамках каких-либо теорий.\u003e\u003e\u003e",
  "correct": [
    "это раздел современной математики, лежащий на стыке математической логики, теории алгоритмов и информатики, возникшей в результате изучения понятий вычислимости и невычислимости. Изначально теория была посвящена вычислимым и невычислимым функциям и сравнению различных моделей вычислений. В наши дни поле исследования теории вычислимости расширилось — появляются новые определения понятия вычислимости и идёт слияние с математической логикой, где вместо вычислимости и невычислимости идёт речь о доказуемости и недоказуемости  утверждений в рамках каких-либо теорий.",
    "Раздел математики, посвящённый понятиям вычилслимости, проблеме остановки и разным базовым моделям вычислений",
    "Область математики, в которой исследуется вычислимость и невычислимость в рамках вычислительных систем, например, машины Тьюринга или частично-рекурсивных функций"
  ],
  "wrong": [
    "это метод исполнения большой заявки (слишком большой, чтобы быть исполненной за раз), когда с помощью особых алгоритмических инструкций большая заявка (parent order) делится на несколько под-заявок (child orders) со своими характеристиками цены и объёма, и каждая из под-заявок отправляется в определённое время на рынок для исполнения",
    "раздел математики, который является разновидностью геометрии, посвященной изучению качественных свойств геометрических фигур, не зависящих от расстояний, величин углов, площадей и объёмов",
    "совокупность точно заданных правил решения некоторого класса задач или набор инструкций, описывающих порядок действий исполнителя для решения определённой задачи",
    "подраздел теоретической информатики, занимающейся исследованием сложности алгоритмов для решения задач на основе формально определённых моделей вычислительных устройств.",
    "Область математики, в которой исследуется вычислимость",
    "Область математики, в которой исследуется вычислимость, электронная почта, процессоры, графы, криптография и прикладная геометрия"
  ],
  "meta": {
    "type": "definition"
  }
}