{
  "id": "05be160a-c02a-4092-91fc-0198bf9853dc.json",
  "task": "К структурной биоинформатике относится разработка алгоритмов и программ для предсказания пространственной структуры белков. Темы исследований в структурной биоинформатике:\n\u003c\u003c\u003cРентгеноструктурный анализ  макромолекул\nИндикаторы качества модели макромолекулы, построенной по данным РСА\nАлгоритмы вычисления поверхности макромолекулы\nАлгоритмы нахождения гидрофобного ядра молекулы белка\nАлгоритмы нахождения структурных доменов белков\nПространственное выравнивание структур белков\nСтруктурные классификации доменов SCOP и CATH\nМолекулярная динамика\u003e\u003e\u003e",
  "correct": [
    [
      "Рентгеноструктурный анализ  макромолекул",
      "Индикаторы качества модели макромолекулы, построенной по данным РСА",
      "Алгоритмы вычисления поверхности макромолекулы",
      "Алгоритмы нахождения гидрофобного ядра молекулы белка",
      "Алгоритмы нахождения структурных доменов белков",
      "Пространственное выравнивание структур белков",
      "Структурные классификации доменов SCOP и CATH",
      "Молекулярная динамика"
    ],
    [
      "1. Методы рентгеноструктурного анализа макромолекул для определения их пространственной структуры.",
      "",
      "2. Разработка и применение индикаторов качества для оценки построенных моделей макромолекулярных структур.",
      "",
      "3. Алгоритмы вычисления и визуализации поверхности макромолекул.",
      "",
      "4. Алгоритмы идентификации и анализа гидрофобного ядра белковых молекул.",
      "",
      "5. Методы автоматического выявления и классификации структурных доменов в белках.",
      "",
      "6. Алгоритмы и методы пространственного выравнивания и сравнения структур белков.",
      "",
      "7. Системы структурной классификации белковых доменов, такие как SCOP и CATH.",
      "",
      "8. Использование молекулярной динамики для моделирования структурных изменений и динамики макромолекул."
    ],
    [
      "Определение пространственной структуры макромолекул с помощью рентгеноструктурного анализа.",
      "",
      "Разработка способов оценки качества построенных моделей макромолекулярных структур.",
      "",
      "Создание алгоритмов для вычисления и визуализации поверхности макромолекул.",
      "",
      "Методы выявления и анализа гидрофобного ядра белковых молекул.",
      "",
      "Разработка методов автоматического распознавания и классификации структурных доменов в белках.",
      "",
      "Алгоритмы и техники для пространственного сравнения и выравнивания структур белков.",
      "",
      "Использование систем структурной классификации белковых доменов, таких как SCOP и CATH.",
      "",
      "Моделирование структурных изменений и динамики макромолекул с помощью молекулярной динамики."
    ]
  ],
  "wrong": [
    "Создание алгоритмов для вычисления и визуализации поверхности атомов.",
    "Методы выявления и анализа кислотных остатков в белковых молекулах.",
    "Разработка методов автоматического распознавания и классификации полезных ископаемых.",
    "Алгоритмы и техники для пространственного сравнения и выравнивания текстов.",
    "Использование систем структурной классификации пейзажей, таких как ПЕЙЗАЖ и ВИДЫ.",
    "Моделирование структурных изменений и динамики макромолекул с помощью ритмичных танцев.",
    "Определение формы и размера облаков с помощью рентгеновского сканирования"
  ],
  "meta": {
    "type": "ul",
    "link": "https://ru.wikipedia.org/wiki/Биоинформатика"
  }
}