{
    "task": "Этот раздел представляет собой неупорядоченный список разнообразных фактов о предмете статьи. Пожалуйста, приведите информацию в энциклопедический вид и разнесите по соответствующим разделам статьи. Списки предпочтительно основывать на вторичных обобщающих авторитетных источниках, содержащих критерий включения элементов в список. <<<Радиолюбители успешно применяют лазерные принтеры в «лазерно-утюжной» технологии изготовления печатных плат для создания маски для травления. Аналогичным образом возможно нанесение надписей или изображений, в том числе цветных, на корпусы радиоприборов и иные объёмные предметы, которые штатным образом не помещаются в принтер. Для этого зеркально отражённый текст распечатывается на вощёной бумаге и в нагретом состоянии под давлением переносится на предмет.\nЛазерные принтеры можно использовать для создания надписей и изображений на металлических поверхностях. Для этого в картридж заправляется специальный тонер, и отпечатывается зеркальное изображение либо зеркальный текст. После отпечатанный лист помещается на металлическую пластину под термопресс. Тонер под давлением и при высокой температуре химически воздействует на металл, образуя устойчивые соединения.>>>",
    "correct": [
        [
            "Радиолюбители успешно применяют лазерные принтеры в «лазерно-утюжной» технологии изготовления печатных плат для создания маски для травления. Аналогичным образом возможно нанесение надписей или изображений, в том числе цветных, на корпусы радиоприборов и иные объёмные предметы, которые штатным образом не помещаются в принтер. Для этого зеркально отражённый текст распечатывается на вощёной бумаге и в нагретом состоянии под давлением переносится на предмет.",
            "Лазерные принтеры можно использовать для создания надписей и изображений на металлических поверхностях. Для этого в картридж заправляется специальный тонер, и отпечатывается зеркальное изображение либо зеркальный текст. После отпечатанный лист помещается на металлическую пластину под термопресс. Тонер под давлением и при высокой температуре химически воздействует на металл, образуя устойчивые соединения."
        ]
    ],
    "wrong": [],
    "meta": {
        "type": "ul",
        "link": "https://ru.wikipedia.org/wiki/Принтер"
    }
}