{
    "task": "Исторически телекоммуникационные технологии, и локальные сети развивались своими независимыми путями. Поэтому одна и та же проблема создания виртуальных соединений  была фактически решена принципиально разными способами. Поэтому , можно выделить два пути:\n<<<Локальный. Строится на базе коммутируемого Ethernet с использованием виртуальных сетей. Разделение происходит на уровне коммутатора, который имеет возможность выделять на канальном уровне одного или нескольких пользователей в группу по некоторым признакам . То есть если есть несколько свитчей в локальной сети с поддержкой стандарта 802.1q можно построить между ними VLAN. Применяется только в LAN.\nТелекоммуникационный. Предполагает создание виртуальных каналов  «поверх» транспортного протокола . Узел-клиент, используя свои учётные данные, устанавливает соединение «точка-точка» с сервером доступа, и уже через этот вновь образованный канал осуществляет передачу/прием данных. При этом как процедура авторизации, так и информационный обмен может быть зашифрован вся, либо частично . Применяется в WAN для связи между публичными IP, можно применять в LAN.>>>",
    "correct": [
        [
            "Локальный. Строится на базе коммутируемого Ethernet с использованием виртуальных сетей. Разделение происходит на уровне коммутатора, который имеет возможность выделять на канальном уровне одного или нескольких пользователей в группу по некоторым признакам . То есть если есть несколько свитчей в локальной сети с поддержкой стандарта 802.1q можно построить между ними VLAN. Применяется только в LAN.",
            "Телекоммуникационный. Предполагает создание виртуальных каналов  «поверх» транспортного протокола . Узел-клиент, используя свои учётные данные, устанавливает соединение «точка-точка» с сервером доступа, и уже через этот вновь образованный канал осуществляет передачу/прием данных. При этом как процедура авторизации, так и информационный обмен может быть зашифрован вся, либо частично . Применяется в WAN для связи между публичными IP, можно применять в LAN."
        ]
    ],
    "wrong": [],
    "meta": {
        "type": "ul",
        "link": "https://ru.wikipedia.org/wiki/Локальная_вычислительная_сеть"
    }
}