{
    "task": "В качестве типового устройства для считывания и записи программ к разъёму «МФ» подключался бытовой кассетный магнитофон. Носителем информации служила классическая магнитофонная кассета типа МК 60, позволявшая хранить информацию до 500 Кбайт. Длительность загрузки программ среднего объёма составляла в среднем 2-3 минуты.\nДля работы с НГМД и НЖМД использовались следующие штатные возможности.<<<КВУ — заводская разработка специально для «Байта-01». Соответственно, выпускалась в более поздних модификациях. Представлял собой подобие современного Midi Tower-корпуса с несколькими НГМД и НЖМД и подключался через разъем «Сист» специальным адаптером для сопряжения модификации «Байт-01» с КВУ. Внешне комбинация «Байта» с КВУ имела сходство скорее с современным IBM PC, чем со Spectrum. КВУ позволял подключать НГМД, НЖМД, параллельный и последовательный порты, локальную сеть. Был предназначен для работы в ОС CP/M.\nПериферия ZX Spectrum, подключаемая через «родные» внешние интерфейсы ZX Spectrum, такие как DISCiPLE, Beta Disk Interface, ZX Interface 1, ZX Interface 2 — см. периферия ZX Spectrum. Периферия под данными интерфейсами работала либо с помощью стандартных команд Sinclair BASIC, либо под управлением DOS-подобных систем, например TR-DOS.>>>",
    "correct": [
        [
            "КВУ — заводская разработка специально для «Байта-01». Соответственно, выпускалась в более поздних модификациях. Представлял собой подобие современного Midi Tower-корпуса с несколькими НГМД и НЖМД и подключался через разъем «Сист» специальным адаптером для сопряжения модификации «Байт-01» с КВУ. Внешне комбинация «Байта» с КВУ имела сходство скорее с современным IBM PC, чем со Spectrum. КВУ позволял подключать НГМД, НЖМД, параллельный и последовательный порты, локальную сеть. Был предназначен для работы в ОС CP/M.",
            "Периферия ZX Spectrum, подключаемая через «родные» внешние интерфейсы ZX Spectrum, такие как DISCiPLE, Beta Disk Interface, ZX Interface 1, ZX Interface 2 — см. периферия ZX Spectrum. Периферия под данными интерфейсами работала либо с помощью стандартных команд Sinclair BASIC, либо под управлением DOS-подобных систем, например TR-DOS."
        ]
    ],
    "wrong": [],
    "meta": {
        "type": "ul",
        "link": "https://ru.wikipedia.org/wiki/Байт_(компьютер)"
    }
}